{"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "activation": "relu", "name": "dense_1", "batch_input_shape": [null, 784]}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "rate": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "activation": "relu", "name": "dense_2"}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "rate": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "activation": "softmax", "name": "dense_3"}}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow"}